# Pandas
Pandas is data structure and data analysis tool for the Python programming language.

In [1]:
# Import
import numpy as np
import pandas as pd

# Series and DataFrames
A Series is very similar to a NumPy array. What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object. DataFrames are the workhorse of pandas. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Da.taFrame Columns are just Series.

In [2]:
# From a list, tuple or array to series
#list1 = [10, 20, 30]
#tuple1 = (10, 20, 30)
array1 = np.array([10, 20, 30])
pd.Series(data = array1)

0    10
1    20
2    30
dtype: int32

In [3]:
# From a list, tuple or array to series with indexing
label1 = ['a', 'b', 'c']
pd.Series(data = array1, index = label1)

a    10
b    20
c    30
dtype: int32

In [4]:
# From a dictionary to series
dict1 = {'name':'Bertan', 'age':28, 'field':'data science'}
pd.Series(data = dict1)

name           Bertan
age                28
field    data science
dtype: object

In [5]:
# From a number to series
pd.Series(5.0, index=['a', 'b', 'c'])

a    5.0
b    5.0
c    5.0
dtype: float64

In [6]:
# Variable assignment
ser1 = pd.Series([10,2,3,4],index = ['Turkiye', 'Germany','USA', 'Japan'])
ser2 = pd.Series([10,2,5,4],index = ['Turkiye', 'Germany','Italy', 'Japan'])

In [7]:
# Select a value
ser1['Turkiye']
#ser1[0]

10

In [8]:
# Select values
ser1[['Turkiye', 'Germany', 'USA']]
#ser1[0:3]

Turkiye    10
Germany     2
USA         3
dtype: int64

In [9]:
# Select condition
ser1[ser1 > 3]

Turkiye    10
Japan       4
dtype: int64

In [10]:
# Method
ser1.mean()

4.75

In [11]:
# Operation in series
ser1 + ser2

Germany     4.0
Italy       NaN
Japan       8.0
Turkiye    20.0
USA         NaN
dtype: float64

In [12]:
# Series to a dataframe
pd.concat(objs = [ser1, ser2], axis = 1)

            0     1
Turkiye  10.0  10.0
Germany   2.0   2.0
USA       3.0   NaN
Japan     4.0   4.0
Italy     NaN   5.0

# Indexing, Slicing and Selection
Indexing, slicing, and selection are possible on the dataframes.

In [13]:
# Variable assignment
matrix1 = np.array([[2.71, 0.62, 0.91, 0.52],
                    [0.65, -0.31, -0.84, 0.62],
                    [-2.01, 0.74, 0.52, -0.58],
                    [0.18, -0.75, -0.93, 0.95],
                    [0.19, 1.97, 2.61, 0.69]])
df1 = pd.DataFrame(matrix1, index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df1

      W     X     Y     Z
A  2.71  0.62  0.91  0.52
B  0.65 -0.31 -0.84  0.62
C -2.01  0.74  0.52 -0.58
D  0.18 -0.75 -0.93  0.95
E  0.19  1.97  2.61  0.69

In [14]:
# Select a column
df1['W']
#df1.loc[:,'W']
#df1.iloc[:,0]

A    2.71
B    0.65
C   -2.01
D    0.18
E    0.19
Name: W, dtype: float64

In [15]:
# Select columns
df1[['W', 'Z']]
#df1.loc[:, ['W', 'Z']]
#df1.iloc[:, [0, -1]]

      W     Z
A  2.71  0.52
B  0.65  0.62
C -2.01 -0.58
D  0.18  0.95
E  0.19  0.69

In [16]:
# Select a row
df1.loc['A']
#df1[0:1]
#df1.iloc[0]

W    2.71
X    0.62
Y    0.91
Z    0.52
Name: A, dtype: float64

In [17]:
# Select rows
df1.loc[['B', 'D']]
#df1[1:4:2]
#df1.iloc[[1, 3]]

      W     X     Y     Z
B  0.65 -0.31 -0.84  0.62
D  0.18 -0.75 -0.93  0.95

In [18]:
# Select an item
df1.loc['B', 'Y']
#df1.iloc[1, 2]

-0.84

In [19]:
# Select items
df1.loc[['A', 'C'], ['W', 'Z']]
#df1.iloc[[0, 2], [0, -1]]

      W     Z
A  2.71  0.52
C -2.01 -0.58

In [20]:
# Select condition
df1 > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [21]:
# Select directly
df1[df1 > 0]

      W     X     Y     Z
A  2.71  0.62  0.91  0.52
B  0.65   NaN   NaN  0.62
C   NaN  0.74  0.52   NaN
D  0.18   NaN   NaN  0.95
E  0.19  1.97  2.61  0.69

In [22]:
# Select directly with a column
df1[df1['W'] > 0]

      W     X     Y     Z
A  2.71  0.62  0.91  0.52
B  0.65 -0.31 -0.84  0.62
D  0.18 -0.75 -0.93  0.95
E  0.19  1.97  2.61  0.69

In [23]:
# Select a column directly with a column
df1[df1['W'] > 0]['Y']

A    0.91
B   -0.84
D   -0.93
E    2.61
Name: Y, dtype: float64

In [24]:
# Select multiple columns directly with a column
df1[df1['W'] > 0][['Y', 'X']]

      Y     X
A  0.91  0.62
B -0.84 -0.31
D -0.93 -0.75
E  2.61  1.97

In [25]:
# Select directly with multiple columns
df1[(df1['W'] > 0) & (df1['Y'] > 1)]

      W     X     Y     Z
E  0.19  1.97  2.61  0.69

In [26]:
# Isin
df1[df1['Z'].isin([0.62, 0.69])]

      W     X     Y     Z
B  0.65 -0.31 -0.84  0.62
E  0.19  1.97  2.61  0.69

In [27]:
# Reset index
df1.reset_index()

  index     W     X     Y     Z
0     A  2.71  0.62  0.91  0.52
1     B  0.65 -0.31 -0.84  0.62
2     C -2.01  0.74  0.52 -0.58
3     D  0.18 -0.75 -0.93  0.95
4     E  0.19  1.97  2.61  0.69

In [28]:
# Set index
index1 = 'CA NY WY OR CO'.split()
df1['States'] = index1
df1.set_index('States', inplace = True)
df1

           W     X     Y     Z
States
CA      2.71  0.62  0.91  0.52
NY      0.65 -0.31 -0.84  0.62
WY     -2.01  0.74  0.52 -0.58
OR      0.18 -0.75 -0.93  0.95
CO      0.19  1.97  2.61  0.69

### Multi-index

In [29]:
# Set multi-index
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
multi_index1 = list(zip(outside,inside))
multi_index1 = pd.MultiIndex.from_tuples(multi_index1)

In [30]:
# Variable assignment
df2 = pd.DataFrame(np.random.randn(6, 2), index = multi_index1, columns = ['A', 'B'])
df2

             A         B
G1 1 -1.442838 -0.799830
   2  0.365431  0.559715
   3 -0.189335 -0.962713
G2 1  0.376111  0.487514
   2 -0.841968 -0.761988
   3  0.609493 -0.581990

In [31]:
# Index names
df2.index.names = ['Group', 'Num']
df2

                  A         B
Group Num
G1    1   -1.442838 -0.799830
      2    0.365431  0.559715
      3   -0.189335 -0.962713
G2    1    0.376111  0.487514
      2   -0.841968 -0.761988
      3    0.609493 -0.581990

In [32]:
# Stack
df2.stack()

Group  Num
G1     1    A   -1.442838
            B   -0.799830
       2    A    0.365431
            B    0.559715
       3    A   -0.189335
            B   -0.962713
G2     1    A    0.376111
            B    0.487514
       2    A   -0.841968
            B   -0.761988
       3    A    0.609493
            B   -0.581990
dtype: float64

In [33]:
# Loc
df2.loc['G1']

            A         B
Num
1   -1.442838 -0.799830
2    0.365431  0.559715
3   -0.189335 -0.962713

In [34]:
# Loc loc
df2.loc['G1'].loc[1]

A   -1.442838
B   -0.799830
Name: 1, dtype: float64

In [35]:
# Xs
df2.xs('G1')

            A         B
Num
1   -1.442838 -0.799830
2    0.365431  0.559715
3   -0.189335 -0.962713

In [36]:
# Xs xs
df2.xs(('G1', 1))

A   -1.442838
B   -0.799830
Name: (G1, 1), dtype: float64

In [37]:
# Xs level
df2.xs(1, level = 'Num')

              A         B
Group
G1    -1.442838 -0.799830
G2     0.376111  0.487514

# Concatenating, Merging, and Joining
Concatenating, merging, and joining are possible on the dataframes.

### Concatenating

In [38]:
# Variable assignment
df3 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                        index = [0, 1, 2, 3])
df3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [39]:
# Variable assignment
df4 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                    'B':['B4', 'B5', 'B6', 'B7'],
                    'C':['C4', 'C5', 'C6', 'C7'],
                    'D':['D4', 'D5', 'D6', 'D7']},
                    index = [4, 5, 6, 7])
df4

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [40]:
# Variable assignment
df5 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                    'B':['B8', 'B9', 'B10', 'B11'],
                    'C':['C8', 'C9', 'C10', 'C11'],
                    'D':['D8', 'D9', 'D10', 'D11']},
                    index = [8, 9, 10, 11])
df5

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [41]:
# Concat
pd.concat([df3,df4,df5])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [42]:
# Concat
pd.concat([df3, df4, df5], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging

In [43]:
# Variable assignment
df6 = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3', 'K4'],
                      'A':['A0', 'A1', 'A2', 'A3', 'A4'],
                      'B':['B0', 'B1', 'B2', 'B3', 'B4']})
df6

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [44]:
# Variable assignment
df7 = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K5', 'K6'],
                      'C':['C0', 'C1', 'C2', 'C5', 'C6'],
                      'D':['D0', 'D1', 'D2', 'D5', 'D6']})   
df7

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K5  C5  D5
4  K6  C6  D6

In [45]:
# Merge inner
pd.merge(df6, df7, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [46]:
# Merge left
pd.merge(df6, df7, how = 'left', on = 'key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN
4  K4  A4  B4  NaN  NaN

In [47]:
# Merge right
pd.merge(df6, df7, how = 'right', on = 'key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K5  NaN  NaN  C5  D5
4  K6  NaN  NaN  C6  D6

In [48]:
# Merge outer
pd.merge(df6, df7, how = 'outer', on = 'key')

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3  NaN  NaN
4  K4   A4   B4  NaN  NaN
5  K5  NaN  NaN   C5   D5
6  K6  NaN  NaN   C6   D6

### Joining

In [49]:
# Variable assignment
df8 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2']},
                 index = ['K0', 'K1', 'K2'])
df8

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [50]:
# Variable assignment
df9 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                 index = ['K0', 'K2', 'K3'])
df9

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [51]:
# Join
df8.join(df9)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [52]:
# Join outer
df8.join(df9, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Groupby
Groupby groups rows of data together and call aggregate functions.

In [53]:
# Variable assignment
dict2 = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
         'Person':['Sam', 'Charlie', 'Amy', 'Vanessa' ,'Carl', 'Sarah'],
         'Sales':[200, 120, 340, 124, 243, 350]}
df10 = pd.DataFrame(dict2)
df10

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [54]:
# Groupby
df10.groupby('Company')

In [55]:
# Groupby aggregate
df10.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [56]:
# Variable assignment
by_comp = df10.groupby('Company')

In [57]:
# Mean
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [58]:
# Std
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [59]:
# Min
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [60]:
# Max
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [61]:
# Count
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [62]:
# Describe
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [63]:
# Describe transpose
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [64]:
# Describe transpose value
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Operations
There are lots of useful operations that can performed on the dataframes.

In [65]:
# Variable assignment
df11 = pd.DataFrame({'col1':[1,2,3,4],
                     'col2':[444,555,666,444],
                     'col3':['abc','def','ghi','xyz']})
df11

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Data

In [66]:
# Head and tail
df11.head()
#df11.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [67]:
# Info
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [68]:
# Describe
df11.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [69]:
# Describe string
df11.describe(include = ["object"])

       col3
count     4
unique    4
top     abc
freq      1

In [70]:
# Columns
df11.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [71]:
# Index
df11.index

RangeIndex(start=0, stop=4, step=1)

In [72]:
# Sort values
df11.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [73]:
# Unique
df11['col2'].unique()

array([444, 555, 666], dtype=int64)

In [74]:
# Nunique
df11['col2'].nunique()

3

In [75]:
# Value counts
df11['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [76]:
# Idxmax and idxmin
#df11['col2'].idxmin()
df11['col2'].idxmax()

2

### Methods and Functions

In [77]:
# Funtion 
def times2(x):
    return x * 2

In [78]:
# Apply
df11['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [79]:
# Apply built-in funtion
df11['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [80]:
# Column operation
df11['col1'].sum()

10

In [81]:
# Min
df11.min()

col1      1
col2    444
col3    abc
dtype: object

### Set and Change

In [82]:
# Create a column
df11['new'] = df11['col1'] * df11['col2']
df11

   col1  col2 col3   new
0     1   444  abc   444
1     2   555  def  1110
2     3   666  ghi  1998
3     4   444  xyz  1776

In [83]:
# Drop a column
df11.drop('new',axis = 1,inplace = True)
df11

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [84]:
# Set a value
#df11.loc[0, 'col1'] = 10
df11.iloc[0, 0] = 10
df11

   col1  col2 col3
0    10   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [85]:
# Set values
#df11.loc[1:4, 'col1'] = df11.loc[1:4, 'col1'] * 10
df11.iloc[1:4, 0] = df11.iloc[1:4, 0] * 10
df11

   col1  col2 col3
0    10   444  abc
1    20   555  def
2    30   666  ghi
3    40   444  xyz

In [86]:
# Drop a row
df11.drop(3, axis = 0, inplace = True)
df11

   col1  col2 col3
0    10   444  abc
1    20   555  def
2    30   666  ghi

In [87]:
# Del column
del df11['col1']
df11

   col2 col3
0   444  abc
1   555  def
2   666  ghi

### Missing Data

In [88]:
#Variable assignment
df12 = pd.DataFrame({'A':[1,2,np.nan],
                     'B':[5,np.nan,np.nan],
                     'C':[1,2,3]})
df12

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [89]:
# Isnan
np.isnan(df12)

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [90]:
# Dropna
df12.dropna()

     A    B  C
0  1.0  5.0  1

In [91]:
# Dropna axis 1
df12.dropna(axis = 1)

   C
0  1
1  2
2  3

In [92]:
# Dropna threshold
df12.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [93]:
# Fillna
df12.fillna(10)

      A     B  C
0   1.0   5.0  1
1   2.0  10.0  2
2  10.0  10.0  3

In [94]:
# Fillna column
df12['A'].fillna(value = df12['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64